#coding: utf-8

# タイトー 電車でGO! 旅情編コントローラー PS2 (USB接続) からPythonに繋ぎこむライブラリ

import usb.core
from Mascon import Mascon
from Button import Button
import logging

class DENSYA_CON_T03(Mascon):
    pass

"""
memo:
初期(保ち) [120, 0, 255, 8, 0, 0, 0, 0]

1ノッチ [120, 60, 255, 8, 0, 0, 0, 0]
2ノッチ 120
3ノッチ 180
4ノッチ 240
NG: 255

視点切り替え [120, 0, 255, 8, 4, 0, 0, 0]
アナウンス [120, 0, 255, 8, 6, 0, 0, 0]
警笛ボタン [120, 0, 255, 8, 1, 0, 0, 0]
右扉 [120, 0, 255, 8, 8, 0, 0, 0]
左扉 [120, 0, 255, 8, 16, 0, 0, 0]
SELECT [120, 0, 255, 8, 32, 0, 0, 0]
START [120, 0, 255, 8, 64, 0, 0, 0]

RIGHT [120, 0, 255, 2, 0, 0, 0, 0]
LEFT [120, 0, 255, 6, 0, 0, 0, 0]
UP [120, 0, 255, 0, 0, 0, 0, 0]
DOWN [120, 0, 255, 4, 0, 0, 0, 0]

ユルメ方向最大 [40, 0, 255, 8, 0, 0, 0, 0]
非常方向最大 [217, 0, 255, 8, 0, 0, 0, 0]
"""
